Revit 2027 API
PathReinforcement.GetOrCreateDefaultRebarShape Method
 Creates a new RebarShape object with a default name or returns existing one which fulfills Path Reinforcement bending data requirements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetOrCreateDefaultRebarShape(
	Document document,
	ElementId rebarBarTypeId,
	ElementId startRebarHookTypeId,
	ElementId endRebarHookTypeId
)
Public Shared Function GetOrCreateDefaultRebarShape (
	document As Document,
	rebarBarTypeId As ElementId,
	startRebarHookTypeId As ElementId,
	endRebarHookTypeId As ElementId
) As ElementId
public:
static ElementId^ GetOrCreateDefaultRebarShape(
	Document^ document,
	ElementId^ rebarBarTypeId,
	ElementId^ startRebarHookTypeId,
	ElementId^ endRebarHookTypeId
)
static member GetOrCreateDefaultRebarShape :
        document : Document *
        rebarBarTypeId : ElementId *
        startRebarHookTypeId : ElementId *
        endRebarHookTypeId : ElementId -> ElementId
Parameters
document Document
 The document.
rebarBarTypeId ElementId
 The id of the RebarBarType.
startRebarHookTypeId ElementId
 The id of the RebarHookType for the start of the bar. If this parameter is InvalidElementId, it means to create a rebar with no start hook.
endRebarHookTypeId ElementId
 The id of the RebarHookType for the end of the bar. If this parameter is InvalidElementId, it means to create a rebar with no end hook.
Return Value
ElementId
 Rebar Shape id.
Exceptions
Exception | Condition
ArgumentException |  rebarBarTypeId should refer to an RebarBarType element. -or- startRebarHookTypeId should be invalid or refer to an RebarHookType element. -or- endRebarHookTypeId should be invalid or refer to an RebarHookType element.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace